In [36]:
import pandas as pd
from sklearn.model_selection import train_test_split
from sklearn.linear_model import LinearRegression
from sklearn.metrics import accuracy_score,r2_score,mean_absolute_error, mean_absolute_percentage_error, mean_squared_error

In [3]:
df=pd.read_csv('Salary Data.csv')

In [5]:
df.head()

   Experience Years  Salary
0               1.1   39343
1               1.2   42774
2               1.3   46205
3               1.5   37731
4               2.0   43525

In [8]:
df.shape

(40, 2)

In [9]:
df.describe()

       Experience Years         Salary
count         40.000000      40.000000
mean           5.152500   74743.625000
std            2.663715   25947.122885
min            1.100000   37731.000000
25%            3.200000   56878.250000
50%            4.600000   64472.500000
75%            6.875000   95023.250000
max           10.500000  122391.000000

In [11]:
df.corr()['Salary']

Experience Years    0.977692
Salary              1.000000
Name: Salary, dtype: float64

In [60]:
xtrain,xtest,ytrain,ytest=train_test_split(df.iloc[:,:1],df['Salary'],train_size=0.8,random_state=2529)

In [61]:
ytrain.shape,ytest.shape

((32,), (8,))

In [62]:
xtrain.head()

    Experience Years
17               4.1
12               3.7
1                1.2
6                2.5
28               6.5

In [63]:
xtrain.shape,xtest.shape

((32, 1), (8, 1))

In [64]:
lr=LinearRegression()
lr.fit(xtrain,ytrain)

LinearRegression()

In [65]:
ypred=lr.predict(xtest)

<h2>accuracy</h2>

In [66]:
r2_score(ytest,ypred)

0.9610384373131337

In [67]:
mean_absolute_error(ytest,ypred)

3688.1856785463488

In [70]:
mean_absolute_percentage_error(ytest,ypred)

0.050339688879149136

In [71]:
mean_squared_error(ytest,ypred)

22326699.302527916